cliuxinxin/esp8266-ai/firmware/src/main.cpp
bool drawWeatherText() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0 || weather.textRev < 0) return false;
  WiFiClient client;
  HTTPClient http;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, "http://" + bridgeHost + "/weather/text.raw")) return false;
  if (http.GET() != HTTP_CODE_OK || http.getSize() != 1 + WEATHER_TEXT_COUNT * WEATHER_TEXT_W * WEATHER_TEXT_H * 2) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  uint8_t count = 0;
  if (stream->readBytes(&count, 1) != 1 || count != WEATHER_TEXT_COUNT) { http.end(); return false; }
  const int xs[WEATHER_TEXT_COUNT] = {4, 4, 116, 174, 8, 88, 168};
  const int ys[WEATHER_TEXT_COUNT] = {4, 22, 136, 4, 184, 184, 184};
  const int widths[WEATHER_TEXT_COUNT] = {100, 90, 100, 62, 64, 64, 64};
  bool ok = true;
  for (int strip = 0; strip < WEATHER_TEXT_COUNT && ok; strip++) {
    for (int row = 0; row < WEATHER_TEXT_H; row++) {
      if (stream->readBytes((uint8_t *)rowBuf, WEATHER_TEXT_W * 2) != WEATHER_TEXT_W * 2) { ok = false; break; }
      tft.pushImage(xs[strip], ys[strip] + row, widths[strip], 1, rowBuf);
      yield();
    }
  }
  http.end();
  return ok;
}

void drawWeatherScreen() {
  if (!weather.valid) {
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    tft.drawString("Weather unavailable", SCREEN_CX, 104, 2);
    tft.drawString("Waiting for Mac bridge", SCREEN_CX, 130, 2);
    weatherChromeDrawn = true;
    return;
  }
  tft.fillScreen(TFT_BLACK);
  weatherChromeDrawn = true;
  weatherTextDrawnRev = -1;
  weatherDirty = false;
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString(weatherValue(weather.temperature, " C"), 12, 48, 7);
  drawWeatherIcon(174, 48, weather.code, 48);
  tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
  tft.drawString("Feels " + weatherValue(weather.apparent, " C"), 12, 102, 2);
  tft.drawString("H/L " + weatherValue(weather.high) + "/" + weatherValue(weather.low), 12, 124, 2);
  tft.drawString("Humidity " + weatherValue(weather.humidity, "%"), 12, 146, 2);
  tft.drawString("Rain " + weatherValue(weather.rain, "%"), 128, 112, 2);
  tft.drawString("Wind " + weatherValue(weather.windSpeed, " km/h"), 116, 158, 2);
  tft.setTextDatum(TR_DATUM);
  tft.drawString("AQI " + weatherValue(weather.aqi), 232, 22, 2);
  if (weather.stale) {
    tft.setTextDatum(TR_DATUM); tft.setTextColor(TFT_YELLOW, TFT_BLACK); tft.drawString("!", 232, 22, 2);
  }
  for (int i = 0; i < weather.forecastCount; i++) {
    int x = 8 + i * 80;
    drawWeatherIcon(x + 18, 201, weather.forecast[i].code, 25);
    tft.setTextDatum(TC_DATUM); tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    tft.drawString(weatherValue(weather.forecast[i].high) + "/" + weatherValue(weather.forecast[i].low), x + 32, 227, 1);
  }
  if (weather.textRev != weatherTextDrawnRev && drawWeatherText()) weatherTextDrawnRev = weather.textRev;
}

void pollWeather() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, "http://" + bridgeHost + "/weather")) return;
  if (http.GET() == HTTP_CODE_OK) handleWeatherPayload(http.getString());
  http.end();
}

// ---------- WiFi / bridge polling ----------

WiFiManager wifiManager; // global: the config portal now runs non-blocking in loop()

void configModeCallback(WiFiManager *wm) {
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("WiFi setup needed", 8, 32, 2);
  tft.drawString("Connect phone to AP:", 8, 62, 2);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString(WIFI_PORTAL_AP_NAME, 8, 87, 2);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("then open 192.168.4.1", 8, 117, 2);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawString("Or: plug into the computer", 8, 155, 2);
  tft.drawString("via USB - no WiFi needed", 8, 178, 2);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("Firmware v" FW_VERSION, 8, 215, 2);
}

// Non-blocking: with saved credentials this still waits ~10s for the join,
// but a missing/failed WiFi no longer traps boot in the portal - the portal
// keeps running from loop() while the USB serial link can take over the
// screen (wired mode for APs with client isolation).
void setupWiFi() {
  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setConfigPortalBlocking(false);

  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("Connecting WiFi...", 8, 100, 2);

  Serial.println("[wifi] starting WiFiManager autoConnect (non-blocking portal)...");
  bool ok = wifiManager.autoConnect(WIFI_PORTAL_AP_NAME);
  Serial.printf("[wifi] autoConnect result=%d ssid=%s ip=%s\n", ok, WiFi.SSID().c_str(),
                WiFi.localIP().toString().c_str());
  Serial.printf("[wifi] bridge host = '%s'\n", bridgeHost.c_str());
}

void resetAutoDisplaySchedule() {
  for (int i = 0; i < AUTO_SCHEDULED_COUNT; ++i) scheduledPages[i] = ScheduledPageState{};
  activeScheduledPage = -1;
  scheduledShowOrder = 0;
}

void readAutoEventSetting(JsonObject object, const char *key, bool &target) {
  JsonVariant value = object[key];
  if (value.is<bool>()) target = value.as<bool>();
}

void readAutoScheduledSetting(JsonObject object, const char *key, AutoScheduledSetting &target) {
  JsonVariant value = object[key];
  if (!value.is<JsonObject>()) return;
  JsonObject setting = value.as<JsonObject>();
  if (setting["enabled"].is<bool>()) target.enabled = setting["enabled"].as<bool>();
  if (setting["interval_seconds"].is<int>()) {
    target.intervalSeconds = setting["interval_seconds"].as<int>();
  }
  if (setting["duration_seconds"].is<int>()) {
    target.durationSeconds = setting["duration_seconds"].as<int>();
  }
}

// Rebuild from compiled defaults for each new revision. A missing or wrongly
// typed field therefore affects only that field, while a missing object from
// an older bridge leaves the currently active/default configuration intact.
void applyAutoDisplayConfig(JsonVariant value) {
  if (!value.is<JsonObject>()) return;
  JsonObject object = value.as<JsonObject>();
  if (!object["revision"].is<int>()) return;
  int revision = object["revision"].as<int>();
  if (revision == autoDisplayRevision) return;

  AutoDisplayConfig next;
  JsonVariant eventsValue = object["events"];
  if (eventsValue.is<JsonObject>()) {
    JsonObject events = eventsValue.as<JsonObject>();
    readAutoEventSetting(events, "claude", next.claudeEnabled);
    readAutoEventSetting(events, "codex", next.codexEnabled);
    readAutoEventSetting(events, "approval", next.approvalEnabled);
    readAutoEventSetting(events, "music", next.musicEnabled);
  }
  JsonVariant scheduledValue = object["scheduled"];
  if (scheduledValue.is<JsonObject>()) {
    JsonObject scheduled = scheduledValue.as<JsonObject>();
    readAutoScheduledSetting(scheduled, "weather", next.scheduled[AUTO_SCHEDULED_WEATHER]);
    readAutoScheduledSetting(scheduled, "quote", next.scheduled[AUTO_SCHEDULED_QUOTE]);
    readAutoScheduledSetting(scheduled, "stock", next.scheduled[AUTO_SCHEDULED_STOCK]);
    readAutoScheduledSetting(scheduled, "net", next.scheduled[AUTO_SCHEDULED_NET]);
  }

  autoDisplayConfig = normalizeAutoDisplayConfig(next);
  autoDisplayRevision = revision;
  resetAutoDisplaySchedule();
}

bool parseStatusJson(const String &payload) {
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload);
  if (err) return false;

  JsonObject c = doc["claude"];
  if (!c.isNull()) {
    claudeStatus.status = c["status"] | "unknown";
    claudeStatus.tokensToday = c["tokens_today"] | 0;
    claudeStatus.sessionMin = c["session_min"] | 0;
    claudeStatus.sessionWindowMin = c["session_window_min"] | 300;
    claudeStatus.fiveHourPct = c["five_hour_pct"] | -1.0;
    claudeStatus.fiveHourResetMin = c["five_hour_reset_min"] | -1;
    claudeStatus.sevenDayPct = c["seven_day_pct"] | -1.0;
    claudeStatus.sevenDayResetMin = c["seven_day_reset_min"] | -1;
    claudeStatus.needsInput = c["needs_input"] | false;
  }

  JsonObject x = doc["codex"];
  if (!x.isNull()) {
    codexStatus.status = x["status"] | "unknown";
    codexStatus.tokensToday = x["tokens_today"] | 0;
    codexStatus.primaryPct = x["primary_pct"] | -1.0;
    codexStatus.primaryResetMin = x["primary_reset_min"] | -1;
    codexStatus.weeklyPct = x["weekly_pct"] | -1.0;
    codexStatus.weeklyResetMin = x["weekly_reset_min"] | -1;
    codexStatus.needsInput = x["needs_input"] | false;
  }
  statusMusicPlaying = doc["music_playing"] | false;
  applyAutoDisplayConfig(doc["auto_display"]);
  return true;
}

