cliuxinxin/esp8266-ai/firmware/src/main.cpp
bool autoDeadlineReached(uint32_t nowMs, uint32_t deadlineMs) {
  return deadlineMs != 0 && static_cast<int32_t>(nowMs - deadlineMs) >= 0;
}

uint32_t autoMilliseconds(int seconds) {
  return static_cast<uint32_t>(seconds) * 1000U;
}

uint8_t autoScheduledValidityMask() {
  uint8_t mask = 0;
  if (weather.valid) mask |= AUTO_DUE_WEATHER;
  // Quote is intentionally left invalid until its data/display path lands in
  // Task 6. Keeping its scheduler slot now avoids changing the wire contract.
  if (stockEverLoaded) mask |= AUTO_DUE_STOCK;
  if (netEverLoaded) mask |= AUTO_DUE_NET;
  return mask;
}

void initializeAutoDueTimes(uint32_t nowMs, uint8_t validMask) {
  for (int i = 0; i < AUTO_SCHEDULED_COUNT; ++i) {
    const uint8_t bit = autoDueBitForScheduledPage(i);
    if (autoDisplayConfig.scheduled[i].enabled && (validMask & bit) && scheduledPages[i].dueMs == 0) {
      scheduledPages[i].dueMs = nowMs + autoMilliseconds(autoDisplayConfig.scheduled[i].intervalSeconds);
    }
  }
}

AutoSelectionInputs autoSelectionInputs(uint8_t validMask, uint8_t dueMask = 0) {
  AutoSelectionInputs input;
  input.config = autoDisplayConfig;
  input.approvalNeeded = claudeStatus.needsInput || codexStatus.needsInput;
  input.claudeWorking = claudeStatus.status == "working";
  input.codexWorking = codexStatus.status == "working";
  // The music page needs HTTP for its cover/text bitmaps, so wired-only mode
  // does not auto-promote it.
  input.musicPlaying = statusMusicPlaying && WiFi.status() == WL_CONNECTED;
  input.validMask = validMask;
  input.dueMask = dueMask;
  input.lastShownWeather = scheduledPages[AUTO_SCHEDULED_WEATHER].lastShownOrder;
  input.lastShownQuote = scheduledPages[AUTO_SCHEDULED_QUOTE].lastShownOrder;
  input.lastShownStock = scheduledPages[AUTO_SCHEDULED_STOCK].lastShownOrder;
  input.lastShownNet = scheduledPages[AUTO_SCHEDULED_NET].lastShownOrder;
  return input;
}

int scheduledPageForAutoChoice(AutoDisplayChoice choice) {
  if (choice == AUTO_WEATHER) return AUTO_SCHEDULED_WEATHER;
  if (choice == AUTO_QUOTE) return AUTO_SCHEDULED_QUOTE;
  if (choice == AUTO_STOCK) return AUTO_SCHEDULED_STOCK;
  if (choice == AUTO_NET) return AUTO_SCHEDULED_NET;
  return -1;
}

DisplayMode displayModeForScheduledPage(int page) {
  if (page == AUTO_SCHEDULED_WEATHER) return MODE_WEATHER;
  if (page == AUTO_SCHEDULED_STOCK) return MODE_STOCK;
  if (page == AUTO_SCHEDULED_NET) return MODE_NET;
  return MODE_AUTO;
}

// The mode actually rendered. Fixed modes bypass this state machine. AUTO
// checks events first, then resumes any interrupted page, then fairly selects
// the oldest valid due page.
DisplayMode effectiveMode() {
  if (displayMode != MODE_AUTO) {
    if (activeScheduledPage >= 0) scheduledPages[activeScheduledPage].untilMs = 0;
    return displayMode;
  }

  const uint32_t nowMs = millis();
  const uint8_t validMask = autoScheduledValidityMask();
  initializeAutoDueTimes(nowMs, validMask);

  if (activeScheduledPage >= 0) {
    ScheduledPageState &active = scheduledPages[activeScheduledPage];
    if (active.untilMs != 0 && autoDeadlineReached(nowMs, active.untilMs)) {
      active.untilMs = 0;
      active.dueMs = nowMs + autoMilliseconds(autoDisplayConfig.scheduled[activeScheduledPage].intervalSeconds);
      activeScheduledPage = -1;
    }
  }

  const AutoDisplayChoice eventChoice = chooseAutoDisplay(autoSelectionInputs(validMask));
  if (eventChoice == AUTO_APPROVAL || eventChoice == AUTO_CLAUDE || eventChoice == AUTO_CODEX ||
      eventChoice == AUTO_MUSIC) {
    if (activeScheduledPage >= 0) {
      // Keep dueMs and activeScheduledPage so this exact page resumes later.
      scheduledPages[activeScheduledPage].untilMs = 0;
    }
    return eventChoice == AUTO_MUSIC ? MODE_MUSIC : MODE_AUTO;
  }

  if (activeScheduledPage >= 0) {
    const uint8_t activeBit = autoDueBitForScheduledPage(activeScheduledPage);
    if (autoDisplayConfig.scheduled[activeScheduledPage].enabled && (validMask & activeBit)) {
      ScheduledPageState &active = scheduledPages[activeScheduledPage];
      if (active.untilMs == 0) {
        active.untilMs = nowMs + autoMilliseconds(autoDisplayConfig.scheduled[activeScheduledPage].durationSeconds);
        active.lastShownOrder = ++scheduledShowOrder;
      }
      return displayModeForScheduledPage(activeScheduledPage);
    }
    scheduledPages[activeScheduledPage].untilMs = 0;
    activeScheduledPage = -1;
  }

  uint8_t dueMask = 0;
  for (int i = 0; i < AUTO_SCHEDULED_COUNT; ++i) {
    if (autoDeadlineReached(nowMs, scheduledPages[i].dueMs)) dueMask |= autoDueBitForScheduledPage(i);
  }
  const AutoDisplayChoice scheduledChoice = chooseAutoDisplay(autoSelectionInputs(validMask, dueMask));
  const int selectedPage = scheduledPageForAutoChoice(scheduledChoice);
  if (selectedPage >= 0) {
    activeScheduledPage = selectedPage;
    ScheduledPageState &selected = scheduledPages[selectedPage];
    selected.untilMs = nowMs + autoMilliseconds(autoDisplayConfig.scheduled[selectedPage].durationSeconds);
    selected.lastShownOrder = ++scheduledShowOrder;
    return displayModeForScheduledPage(selectedPage);
  }
  return MODE_AUTO;
}

void pollBridge() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) {
    Serial.printf("[bridge] skip poll: wifi=%d host='%s'\n", WiFi.status() == WL_CONNECTED, bridgeHost.c_str());
    return;
  }

  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + BRIDGE_DEFAULT_PATH;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);

  if (!http.begin(client, url)) {
    Serial.println("[bridge] http.begin() failed");
    return;
  }
  int code = http.GET();
  Serial.printf("[bridge] GET %s -> %d\n", url.c_str(), code);
  if (code == HTTP_CODE_OK) {
    String payload = http.getString();
    if (parseStatusJson(payload)) {
      lastSuccessMs = millis();
      everPolled = true;
      Serial.printf("[bridge] claude=%s tok=%ld | codex=%s tok=%ld primary=%.0f%%\n",
                    claudeStatus.status.c_str(), claudeStatus.tokensToday,
                    codexStatus.status.c_str(), codexStatus.tokensToday, codexStatus.primaryPct);
    } else {
      Serial.println("[bridge] JSON parse failed");
    }
  } else {
    claudeStatus.status = "offline";
    codexStatus.status = "offline";
  }
  http.end();
  DisplayMode eff = effectiveMode();
  if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK && eff != MODE_WEATHER) {
    // Only a real app switch clears the screen; a plain data refresh paints
    // in place so the poll doesn't flash the whole display.
    if (updateActiveApp()) drawActiveApp();
    else refreshActiveApp();
  }
}

// ---------- wired (USB serial) bridge link ----------
// Fallback for WiFi networks with client isolation (device can't reach the
// bridge over LAN) - or for skipping WiFi setup entirely: when the clock is
// plugged into the computer over USB, the bridge pushes the same /status and
// /net payloads down the CH340 serial line as newline-terminated frames:
//   bridge -> device:  #HELLO   #STATUS {json}   #NET {json}   #CMD {json}
//   device -> bridge:  #DEVICE {"name":"aiclock","fw":"x.y.z"}
// Everything else the device prints (logs) is ignored by the bridge.
unsigned long lastSerialFrameMs = 0;
bool wiredEverLinked = false;
char serialLine[1600]; // biggest frame is #STATUS at ~600 bytes
size_t serialLineLen = 0;

bool wiredActive() { return wiredEverLinked && (millis() - lastSerialFrameMs) < 15000UL; }

// First data over either transport replaces the boot/portal screen.
void showMainUiIfNeeded() {
  if (mainUiShown) return;
  mainUiShown = true;
  drawStaticChrome();
  updateActiveApp();
  drawActiveApp();
}

void handleSerialFrame(char *line) {
  lastSerialFrameMs = millis();
  wiredEverLinked = true;
  if (!strncmp(line, "#HELLO", 6)) {
    Serial.printf("#DEVICE {\"name\":\"aiclock\",\"fw\":\"%s\"}\n", FW_VERSION);
    return;
  }
  if (!strncmp(line, "#STATUS ", 8)) {
    if (parseStatusJson(String(line + 8))) {
      lastSuccessMs = millis();
      everPolled = true;
      showMainUiIfNeeded();
      DisplayMode eff = effectiveMode();
      if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK && eff != MODE_WEATHER) {
        if (updateActiveApp()) drawActiveApp();
        else refreshActiveApp();
      }
    }
    return;
  }
  if (!strncmp(line, "#NET ", 5)) {
    handleNetPayload(String(line + 5));
    return;
  }
  if (!strncmp(line, "#STOCK ", 7)) {
    handleStockPayload(String(line + 7));
    return;
  }
  if (!strncmp(line, "#CMD ", 5)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 5)) return;
    if (doc["brightness"].is<int>()) {
      brightness = constrain(doc["brightness"].as<int>(), 0, 100);
      applyBrightness();
      saveBrightness();
    }
    const char *mode = doc["display"] | (const char *)nullptr;
    if (mode) {
      String m(mode);
      if (m == "auto") displayMode = MODE_AUTO;
      else if (m == "claude") displayMode = MODE_CLAUDE;
      else if (m == "codex") displayMode = MODE_CODEX;
      else if (m == "net") displayMode = MODE_NET;
      else if (m == "music") displayMode = MODE_MUSIC;
      else if (m == "stock") displayMode = MODE_STOCK;
      else if (m == "weather") displayMode = MODE_WEATHER;
      // the effectiveMode transition handler in loop() repaints the chrome
    }
    return;
  }
}

