cliuxinxin/esp8266-ai/firmware/src/main.cpp
  unsigned long nowMs = millis();

  // Weather stays warm in AUTO so a scheduled window never blocks on HTTP.
  if (WiFi.status() == WL_CONNECTED && bridgeHost.length() > 0 &&
      (displayMode == MODE_AUTO || displayMode == MODE_WEATHER) &&
      (lastWeatherPollMs == 0 || nowMs - lastWeatherPollMs >= WEATHER_POLL_INTERVAL_MS)) {
    lastWeatherPollMs = nowMs;
    pollWeather();
  }

  // Prime scheduled pages that do not arrive in /status. Once a first valid
  // payload is cached, their normal per-mode poll loops keep them fresh.
  if (WiFi.status() == WL_CONNECTED && bridgeHost.length() > 0 && displayMode == MODE_AUTO) {
    if (autoDisplayConfig.scheduled[AUTO_SCHEDULED_STOCK].enabled && !stockEverLoaded &&
        (lastStockPollMs == 0 || nowMs - lastStockPollMs >= STOCK_POLL_INTERVAL_MS)) {
      lastStockPollMs = nowMs;
      pollStock();
    }
    if (autoDisplayConfig.scheduled[AUTO_SCHEDULED_NET].enabled && !netEverLoaded &&
        (lastNetPollMs == 0 || nowMs - lastNetPollMs >= NET_POLL_INTERVAL_MS)) {
      lastNetPollMs = nowMs;
      pollNet();
    }
  }

  // Effective mode may differ from the configured one (AUTO -> music while
  // audio plays). On a transition, reset the incoming mode's chrome so it
  // repaints cleanly, and repaint the pet immediately when returning to it.
  DisplayMode eff = effectiveMode();
  if (eff != lastEffectiveMode) {
    lastEffectiveMode = eff;
    if (eff == MODE_NET) {
      netChromeDrawn = false;
      lastNetPollMs = 0;
    } else if (eff == MODE_MUSIC) {
      musicChromeDrawn = false;
      lastMusicPollMs = 0;
    } else if (eff == MODE_STOCK) {
      stockChromeDrawn = false;
      lastStockPollMs = 0;
    } else if (eff == MODE_WEATHER) {
      weatherChromeDrawn = false;
      lastWeatherPollMs = 0;
    } else {
      updateActiveApp();
      drawActiveApp();
    }
  }

  if (eff == MODE_NET) {
    // net-speed mode: rendering (constant-rate sweep) is independent of the
    // bridge polls that refill its sample queue
    if (nowMs - lastNetDrawMs >= NET_DRAW_INTERVAL_MS) {
      lastNetDrawMs = nowMs;
      netDrawTick();
    }
    if (nowMs - lastNetPollMs >= NET_POLL_INTERVAL_MS) {
      lastNetPollMs = nowMs;
      pollNet();
    }
  } else if (eff == MODE_MUSIC) {
    // music now-playing mode: cover art + track metadata from the bridge
    if (nowMs - lastMusicPollMs >= MUSIC_POLL_INTERVAL_MS) {
      lastMusicPollMs = nowMs;
      pollMusic();
    }
  } else if (eff == MODE_STOCK) {
    // stock watchlist: HTTP poll unless the serial link is pushing #STOCK
    if (nowMs - lastStockPollMs >= STOCK_POLL_INTERVAL_MS) {
      lastStockPollMs = nowMs;
      if (!wiredActive()) pollStock();
    }
    if (!stockChromeDrawn || stockDirty) drawStockScreen();
  } else if (eff == MODE_WEATHER) {
    if (!weatherChromeDrawn || weatherDirty) drawWeatherScreen();
  } else {
    // sprite walk-cycle animation (only advances while that app is showing)
    if (nowMs - lastAnimMs >= ANIM_INTERVAL_MS) {
      lastAnimMs = nowMs;
      bool claudeWorking = claudeStatus.status == "working" &&
                           (displayMode != MODE_AUTO || autoDisplayConfig.claudeEnabled);
      bool codexWorking = codexStatus.status == "working" &&
                          (displayMode != MODE_AUTO || autoDisplayConfig.codexEnabled);
      if (showingCd != CD_NONE) {
        // countdown owns the center area: no sprite frames over it
      } else if (currentApp == APP_CLAUDE && claudeWorking) {
        claudeFrame = (claudeFrame + 1) % claudeFrameCount();
        drawClaudeSprite(claudeFrame);
      } else if (currentApp == APP_CODEX && codexWorking) {
        codexFrame = (codexFrame + 1) % codexFrameCount();
        drawCodexSprite(codexFrame);
      }
    }

    // countdown seconds tick locally between bridge polls
    static unsigned long lastCdTickMs = 0;
    if (showingCd != CD_NONE && nowMs - lastCdTickMs >= 1000) {
      lastCdTickMs = nowMs;
      drawCountdown(false);
    }

    // "urgent" flash toggle (independent, faster cadence)
    if (nowMs - lastFlashMs >= FLASH_INTERVAL_MS) {
      lastFlashMs = nowMs;
      flashOn = !flashOn;
      if (bridgeStale()) {
        redrawRingOnly();
      } else if (currentAppNeedsInput()) {
        // approval needed: blink the whole border red, restore the quota ring
        // on the off-phase so it doesn't erase the normal chrome permanently
        if (flashOn) drawFullBorder(TFT_RED);
        else redrawRingOnly();
      }
    }

    // alternate which app is shown when neither/both are uniquely working
    if (updateActiveApp()) {
      drawActiveApp();
    }
  }

  // status poll continues in every mode (feeds /api/info and the web page).
  // Wired-first: while serial frames are flowing, skip HTTP polling entirely
  // (works around AP client isolation, and avoids double updates).
  if (nowMs - lastPollMs >= BRIDGE_POLL_INTERVAL_MS) {
    lastPollMs = nowMs;
    if (!wiredActive()) pollBridge();
  }
}
